[
    {
        "_id": "5a826097ee14ba111092eb90",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-13T03:50:47.320Z",
        "message": "Also this may be a bit forward, but as you’ll probably learn I’m not really one for propriety lol, but I don’t wanna spend a week and a half talking over tinder, so my number is 7163972925. You’ve also probably noticed I’m bad at replying in a timely fashion, just know that I kinda hate phones and try not to use mine as much as possible, so that’s why it takes me forever to respond lol",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-13T03:50:47.320Z",
        "timestamp": 1518493847320
    },
    {
        "_id": "5a825c8328279db20f3d9049",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-13T03:33:23.217Z",
        "message": "I could do anytime on the 23rd, just not late because I have class at 8 am on Saturday morning, random tidbit in exchange for your random tidbit, I’m currently taking EMT courses lol. Also, as to your random tidbit, I actually enjoyed a brief stint on the UB sailing team, and I absolutely loved it, however sailing is NOT easy haha. Ever think about taking lessons first? And also, you happened to pick two places I love, but let’s see how the weather is and maybe we can explore a bit",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-13T03:33:23.217Z",
        "timestamp": 1518492803217
    },
    {
        "_id": "5a825a4c7cf914f75b9d1311",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-13T03:23:56.018Z",
        "message": "Ok. Let’s do something on the 23rd, 24th, or 25th (or whenever you’re free - which day works best for you?) For coffee/food, I’d like to suggest the Daily Planet and Cantina Loco, but I’ll be even happier to go somewhere you enjoy. What are your favorite cuisines, restaurants, and cafes? Random tidbit about my life: I purchased a sailboat two summers ago, partly because one of my friends had recently sailed the northwest passage and I envied her experiences and partly to appease some Cousteauian escapist fantasy. It was a huge mistake.",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-13T03:23:56.018Z",
        "timestamp": 1518492236018
    },
    {
        "_id": "5a8251f032f9358a0f8d89bb",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-13T02:48:16.797Z",
        "message": "I definitely would love an actual human perspective on working in the UN! And ugh yeah my other dream job when I was 5 was being a marine biologist haha. I’d definitely like to meet up for some good food or coffee, but I’m not exaggerating when I say I don’t have an evening free until a week from Friday😑 my life is a bit crazy until May-ish unfortunately",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-13T02:48:16.797Z",
        "timestamp": 1518490096797
    },
    {
        "_id": "5a8117df8353899e0ff71d30",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-12T04:28:15.335Z",
        "message": "I feel like there's so much more we could talk about. Would you be interested in meeting in person? I could treat you to dinner (or at the very least a cup of coffee), or perhaps we could find something more unique or adventurous to do together. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-12T04:28:15.335Z",
        "timestamp": 1518409695335
    },
    {
        "_id": "5a8116896b6e0406105f40bd",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-12T04:22:33.166Z",
        "message": "Cuisine is a fantastic reason to want to revisit a place. Merida sounds amazing. I have so many great memories about different places I’ve visited and different experiences I’ve had while traveling. Many of them are food related. Others are perhaps things I’ll try to relive or share with my family and friends as I get older. I’d love to see Egypt as well. My mother has talked about going since I was little but she’s fearful of state department travel advisories and I don’t think I’ll ever be able to convince her to go with me. She would read to me before bed when I was younger and I still have vivid memories of her narrating an Egyptian mythology book. I hope that you create an opportunity to travel to Egypt soon. I also really like that you idolize an archaeologist. I grew up watching Jacque Cousteau and thought I would explore the ocean. Now, I explore the internet instead 😕",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-12T04:22:33.166Z",
        "timestamp": 1518409353166
    },
    {
        "_id": "5a8116630c5553d10f4fa783",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-12T04:21:55.002Z",
        "message": "I have only worked for companies that have been contracted by the UN, but my Malawi - UNICEF business partner was an Innovation Specialist at UN Global Pulse and the friend I traveled to Ethiopia with was a Diplomatic Advisor to Kofi Annan. Even from my limited interactions with the UN, I could drone on for hours about its quirks (perhaps in person?). Most of my friends have left the UN to pursue private ventures that contract with the UN. If working at the UN is something you’d like to explore soon, I’ll happily connect you or at the very least, pass your CV along. I also have some experience with private foundations. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-12T04:21:55.002Z",
        "timestamp": 1518409315002
    },
    {
        "_id": "5a80f629929968f50f01abf7",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-12T02:04:25.198Z",
        "message": "I used to read encyclopedias on ancient Egypt for fun, I taught myself hieroglyphics at one point, and on of my idols is Zahi Hawass (basically real life Egyptian Indiana Jones)",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-12T02:04:25.198Z",
        "timestamp": 1518401065198
    },
    {
        "_id": "5a80f5c5ae5ffeb50f8ad18a",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-12T02:02:45.725Z",
        "message": "I’d most like to go back to Merida, Mexico because the food was un.real. But the place I’ve wanted to go most since I was about 5 years old is Egypt",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-12T02:02:45.725Z",
        "timestamp": 1518400965725
    },
    {
        "_id": "5a80f58f529057dc0f4604f7",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-12T02:01:51.612Z",
        "message": "That’s awesome! Not gonna lie, the UN is my future dream job (not exactly my dream right now job though lol). What was it like working for them??",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-12T02:01:51.612Z",
        "timestamp": 1518400911612
    },
    {
        "_id": "5a7f6deadebb1d970f133710",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T22:10:50.559Z",
        "message": "Hey, sorry for spamming you. I just realized that my last sentence clipped. I wanted to ask: where would you like to go next?",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T22:10:50.559Z",
        "timestamp": 1518300650559
    },
    {
        "_id": "5a7f483fa0f072371031db49",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T19:30:07.628Z",
        "message": "E) Which pictures are you referring to? My profile photos were taken 1) in the lobby of an organization called Y Combinator in Mountain View California 2) My sisters wedding in Lake Como 3) A glacier near the northwest coast of Spitzbergen during a four day long snowmobile trip. I was (probably) briefly the most northern person in the world - in winter 4) Wonchi Crater Lake ~ 4 hours outside of Addis Ababa in Ethiopia. I spent a month in Addis building data visualization tools for the UN / Ethiopian Ministry of Health in 2016 and Wonchi was my only excursion 5) My backyard and 6) a sign in Longyearbyen. I’ve got a map of most of the places that I’ve traveled to on my website, or you can see it at https://goo.gl/nE3eDt I’ve also been to a lot of places I don’t have pictures of. In 2017, I think I traveled domestically for ~ 1 month and visited ~ 15 countries traveling over 3 months. You seem to travel a lot as well. Where would you most like to go back to and where would you like to ...",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T19:30:07.628Z",
        "timestamp": 1518291007628
    },
    {
        "_id": "5a7f482379b6e63110381c30",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T19:29:39.366Z",
        "message": "D) I recently started spending most of my time in Buffalo and I’ve come to realize that don’t have many friends here anymore. I could ramble on for a couple paragraphs but they would reach your conclusion. I’m unsure of what I’m hoping to find. I suppose I’d like to see what’s available. If we're still talking when you decide what you're looking for, I hope that I'll have more clarity too and will be able to provide a better answer. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T19:29:39.366Z",
        "timestamp": 1518290979366
    },
    {
        "_id": "5a7f478cabc24501105922ec",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T19:27:08.659Z",
        "message": "😎 It was the second result when I searched for “Hannah Griffith Buffalo”: https://www.buffalo.edu/giving/give-to.host.html/content/shared/www/giving/ub-fund/hannah-griffith.detail.html \nI’m glad you found something that closely aligned with what you wanted to do. I hope that it’s something that brings you joy and purpose. \n\nC) I think I understand, I can be critical of myself and often find it difficult to receive compliments. I’m not sure if you the same way, but I would be weirded out too if a stranger from the internet googled me and expressed adoration in what I see as mundane. I am sorry for weirding you out. The combination of you messaging me first (which has never happened to me before) and your interests were really exciting to me. Thank you for the reality check. I’ll do a better job of controlling my excitment. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T19:27:08.659Z",
        "timestamp": 1518290828659
    },
    {
        "_id": "5a7f4754b303091a590e25a8",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T19:26:12.516Z",
        "message": "Hey Hannah, responding in your format. \n\nA) You brought up a lot of interesting points here. I generally agree with you in terms of gear. Photos should say more about the photographer than they do about the camera. I am always surprised by the people don’t seem to understand that. You have the right attitude when it comes to experience and photography. Experience should take precedence to the documentation of experience. For me, photography is an intentional activity and something I seldom do unless asked or unless spending time with another photographer. I mostly choose to take photos as a way to spend time with some my friends. On rare occasions, I’ve built accessories (lighting, GPS, steady cams, dollys, etc.) and even medium and large format cameras. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T19:26:12.516Z",
        "timestamp": 1518290772516
    },
    {
        "_id": "5a7f104832dacdd70f522ecb",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T15:31:20.339Z",
        "message": "The real question I have is where are you in all those awesome travel pics/where have you traveled to besides that?",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-10T15:31:20.339Z",
        "timestamp": 1518276680339
    },
    {
        "_id": "5a7f0fe2a0bf530e106e7cbb",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T15:29:38.237Z",
        "message": "D) why am I here? That is a fantastic question and I will let you know when I have an answer to it lol",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-10T15:29:38.237Z",
        "timestamp": 1518276578237
    },
    {
        "_id": "5a7f0fc8578e63ef0fca807e",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T15:29:12.542Z",
        "message": "C) I’m a little weirded out by compliments about myself so maybe we can keep those to a minimum for now? Haha I know that sounds really weird, but it’s just how I am",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-10T15:29:12.542Z",
        "timestamp": 1518276552542
    },
    {
        "_id": "5a7f0f602cf960d60ff78309",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T15:27:28.393Z",
        "message": "B) I don’t even remember writing about that idea for a non-profit, where did you find that? I’ll check out that website when I get a minute, but I’m actually currently interning with a non-profit that’s doing that exact thing",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-10T15:27:28.393Z",
        "timestamp": 1518276448393
    },
    {
        "_id": "5a7f0f2279b6e631103460bb",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T15:26:26.533Z",
        "message": "Wow that’s a lot lol. A) I’m glad you like my photography, but I also don’t consider myself a photographer because I’m not super serious about it, I honestly prefer point-and-shoot cameras to a DSLR. I even use disposable cameras still lol. I’d rather be in a moment and appreciating it for what it is than wasting it by trying to get the right settings.",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-10T15:26:26.533Z",
        "timestamp": 1518276386533
    },
    {
        "_id": "5a7e7a930ffdffe70f46af53",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T04:52:35.228Z",
        "message": "I apologize for inundating you with a wall of text. Please don’t feel compelled to write an essay (unless, of course, you’d like to). I just realized that I didn’t ask any questions. You are beautiful, ambitious, kind, talented, well traveled, and have admirable values. Why did you join tinder / what are you looking for? I’m genuinely surprised that you’re here (and glad we matched).",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T04:52:35.228Z",
        "timestamp": 1518238355228
    },
    {
        "_id": "5a7e79232a66c6a16a5c246f",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T04:46:27.978Z",
        "message": "I don’t have much more to add other than to say that you seem like an amazing person and that I will try very hard not to disappoint you. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T04:46:27.978Z",
        "timestamp": 1518237987978
    },
    {
        "_id": "5a7e791641d6cc3110abe04c",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T04:46:14.853Z",
        "message": "I formerly helped administer a student nonprofit focused on educational and engineering projects, and currently spend ~ 20% of my time working for an NGO in the coffee sector and running an independent consultancy that works with UNICEF in Malawi. You can read about me at https://mdlangelo.com if you’d like, but please be gentle. It wasn’t built for this audience.",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T04:46:14.853Z",
        "timestamp": 1518237974853
    },
    {
        "_id": "5a7e790b6b6e04061035e5bd",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T04:46:03.190Z",
        "message": "I also read about how you intended to start a nonprofit for dual communities. If you pursued this, I’d love to hear more about your value proposition, and your experiences in building something from scratch. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T04:46:03.190Z",
        "timestamp": 1518237963190
    },
    {
        "_id": "5a7e78f2abc24501104becfa",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T04:45:38.287Z",
        "message": "I looked at your Instagram and at your website. You’re an amazing photographer and a great storyteller. You’re doing what I’ve always wanted to do with my photography (except that I am less of a photographer than a photography gear enthusiast and collector). I hope you continue adding new content to your site. I am excited to read your next post. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T04:45:38.287Z",
        "timestamp": 1518237938287
    },
    {
        "_id": "5a7e78dd099c20eb0fbd4a46",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T04:45:17.166Z",
        "message": "Hi Hannah, That is perhaps the best and kindest tinder message I’ve ever received. The solipsist in me would like to assure you that I am not a robot or quasi-sapient targeted advertisement, although you seem so perfect that I may have briefly questioned reality. At the very least, you are a welcome respite (and hopefully much more than a respite) in a sea of single mothers and estheticians. ",
        "to": "581ff8dba400e8860ae43ede",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2018-02-10T04:45:17.166Z",
        "timestamp": 1518237917166
    },
    {
        "_id": "5a7e68dc00c50ddb0fe5cf78",
        "match_id": "53d5eeccb85c95c5347c8c6a581ff8dba400e8860ae43ede",
        "sent_date": "2018-02-10T03:37:00.367Z",
        "message": "You know how the internet these days knows everything you like and so every ad you see is stuff you really like? I feel like tinder just did that with a dude for me. No joke I kinda think you’re a robot or a targeted ad made by tinder",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "581ff8dba400e8860ae43ede",
        "created_date": "2018-02-10T03:37:00.367Z",
        "timestamp": 1518233820367
    }
]