[
    {
        "_id": "57f55ef95a0ca0b40a42e945",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-05T20:13:45.570Z",
        "message": "Haha space seems like a cool concept but it creeps me out a bit. I like the idea of going but I'm not ready to leave earth behind. Maybe if space travel ever becomes a regular thing! What kind of financial products? Like calculator type things? After school I'd like to do something with nonprofit management in the education and literacy sector. I definitely want to see a lot of the world so something that lets me be mobile would be great. Would end goal love to work as an foreign ambassador with global affairs Canada but you usually need quite a lot of experience under your belt for that. And I'm located in nkozi, about 2 hours away from kampala down masaka road. And haha I'm actually visiting entebbe this weekend! Maybe I'll see your plane leave. Do you have WhatsApp? I prefer to chat through there it's a more cooperative interface for my phone. My WhatsApp ID is +19024993907 if you want to add me there and chat. :)",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "53015f1f9381b9bb74003b58",
        "created_date": "2016-10-05T20:13:45.570Z",
        "timestamp": 1475698425570
    },
    {
        "_id": "57f531a0c6232ec07fa446cd",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-05T17:00:16.532Z",
        "message": "Thanks Samantha :) I'd love to go to space someday! But not soon and not as temporally far away as mars. Would you like to go to space? I've only spent time in the greater Kampala and Entebbe area :( I'm hoping to travel more next month. When I was still in grad school, I confounded a fintech company that builds new financial products. We have 18 (!) employees now and the company is doing ok, but I've almost completely lost interest, hence my sabbatical :/ \nI'm impressed! What would you like to do after you finish school? And where are you based in Uganda?",
        "to": "53015f1f9381b9bb74003b58",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2016-10-05T17:00:16.532Z",
        "timestamp": 1475686816532
    },
    {
        "_id": "57f35997f61e765a534cc50f",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-04T07:26:15.049Z",
        "message": "Wow! That's amazing. Everything you said. Satellite images of farms wow thats incredible! Do you want to go to space someday? And yeah Uganda is beautiful. Were you just in kampala or did you get to see some other areas as well? And ooh sabbatical so fancy haha what's your normal gig then? I study international development studies and global business management - am near the end of a dual degree. :)",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "53015f1f9381b9bb74003b58",
        "created_date": "2016-10-04T07:26:15.049Z",
        "timestamp": 1475565975049
    },
    {
        "_id": "57f34d5bd7cc0e4b0a5c22bf",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-04T06:34:03.908Z",
        "message": "That's an awesome project! And your experience sounds amazing as well. A few days learning how to use a mouse!? I've been using computers for so long that I've forgotten what learning to use them was like. That sounds like such a fulfilling project. I hope you enjoy your time here. \nThe bill Nye nonprofit is called SEDS (students for the exploration and development of space). It's an international space advocacy group filled with college aged space enthusiasts. I volunteered with the organization for 6 years and used to sit on the board of directors of it. Now I'm here with a new ngo focused on verifying famers and providing technical assistance to them. I'm on sabbatical from my real job and have been writing algorithms to automatically identify farms in satellite imagery. I flew in this week for some meetings (leaving Sunday), but I plan to be back for an extended period at the end of the month. Uganda is beautiful. I'm so happy I decided to come here. \n\np.s. What do you study?",
        "to": "53015f1f9381b9bb74003b58",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2016-10-04T06:34:03.908Z",
        "timestamp": 1475562843908
    },
    {
        "_id": "57f32b69d7cc0e4b0a5830ee",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-04T04:09:13.843Z",
        "message": "Wow thats amazing! What is your non profit about, what do you do? I'm here on a program called \"Queen Elizabeth Scholars\" so basically the Canadian government in partnership with the queen of England gave out a bunch of money to Canadian universities who expressed interest in doing projects in developing countries. It works on a bit of an exchange basis, so our partner in uganda takes interns, and then my school in canada takes ugandan students for study in Canada. Our project is called \"bridging the digital divide in rural uganda\" and right now I'm working with a children's home training some staff and students on computer basics. And i mean basics, we had to start with how to even operate a mouse for a few days! I'll start working with a vocational school soon too. But that's the gist of it! Im here until the end of April. What brings you to Uganda?",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "53015f1f9381b9bb74003b58",
        "created_date": "2016-10-04T04:09:13.843Z",
        "timestamp": 1475554153843
    },
    {
        "_id": "57f2bcd8a10d6f204d7c3ddd",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-03T20:17:28.465Z",
        "message": "Bill used to advise my nonprofit.  I have his cell phone number! We can prank call him if you'd like. Ive even been to his house at the same time as Buzz Aldrin and Rick Tumlinson. I could go on, but I suspect your stories can easily top mine. And I promise to never ever vote to elect Trump to political office. What are you doing in Uganda!?! I'd love to hear about your internship.",
        "to": "53015f1f9381b9bb74003b58",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2016-10-03T20:17:28.465Z",
        "timestamp": 1475525848465
    },
    {
        "_id": "57f29afab974a5c42c17ed35",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-03T17:52:58.501Z",
        "message": "Ummmmmm you went to Stanford and met Bill Nye (the science guy)?! As long as you're not voting for Trump, I think I should be the one proposing to you!",
        "to": "53d5eeccb85c95c5347c8c6a",
        "from": "53015f1f9381b9bb74003b58",
        "created_date": "2016-10-03T17:52:58.501Z",
        "timestamp": 1475517178501
    },
    {
        "_id": "57f17af153b2133c0a3c09bb",
        "match_id": "53015f1f9381b9bb74003b5853d5eeccb85c95c5347c8c6a",
        "sent_date": "2016-10-02T21:24:01.581Z",
        "message": "Hey Samantha. You're Canadian, adorable, and friends with Justin Trudeau and an alpaca!?! I don't think I've ever seen a more awesome Canadian. Are you currently soliciting  marriage proposals? And if so, may I apply?",
        "to": "53015f1f9381b9bb74003b58",
        "from": "53d5eeccb85c95c5347c8c6a",
        "created_date": "2016-10-02T21:24:01.581Z",
        "timestamp": 1475443441581
    }
]